app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("desc", "created_at", "updated_at") VALUES (?, ?, ?)  [["desc", "dsdcsdc"], ["created_at", "2015-08-04 14:06:54.203368"], ["updated_at", "2015-08-04 14:06:54.203368"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "desc" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["desc", "dsdcsdcdd"], ["updated_at", "2015-08-04 14:06:58.364758"], ["id", 1]]