app/controllers/tvs_controller.rb

SELECT "bestbuys".* FROM "bestbuys"
---
  def result
    @data = Bestbuy.all

SELECT "bestbuys".* FROM "bestbuys"
---
  def product
    @data = Bestbuy.all